heatTransfer/buoyantSimpleFoam/hotRadiationRoomFvDOM/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    floor
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }

    ceiling
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }

    fixedWalls
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }

    box
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }
}

// ************************************************************************* //
